.config/yadm/ondemand/docker.org
:PROPERTIES:
#+property: header-args :tangle docker.sh##distro.Ubuntu,e.sh :mkdirp yes :comments both :shebang "#!/bin/bash"
#+startup: fold
:END:

Note: This file includes both rootless and rootful setup blocks.

Rootless is commented out because things like `ipc=host` don't work with it:
https://raesene.github.io/blog/2020/12/19/rootless_docker/, and these are
recommended on the NGC container page for performance
https://catalog.ngc.nvidia.com/orgs/nvidia/containers/pytorch

If you're using rootless mode, see [[file:~/.zshcustom/docker.zsh::Only for rootless install][export DOCKER_HOST]]


* Warning

#+begin_src shell
# Do not edit this file, tangle from docker.org
#+end_src

* Header
#+begin_src shell

# To get retry()
source ${ZSH_CUSTOM_DIR}/scriptlib.zsh

set -eux
#+end_src

* Install using convenience script

https://docs.docker.com/engine/install/ubuntu/#install-using-the-convenience-script

This stupidly fails with some postinstall error:

#+begin_example
Job for docker.service failed because the control process exited with error code.
See "systemctl status docker.service" and "journalctl -xe" for details.
invoke-rc.d: initscript docker, action "start" failed.
● docker.service - Docker Application Container Engine
     Loaded: loaded (/lib/systemd/system/docker.service; enabled; vendor preset: enabled)
     Active: activating (auto-restart) (Result: exit-code) since Wed 2022-02-09 17:42:54 PST; 5ms ago
TriggeredBy: ● docker.socket
       Docs: https://docs.docker.com
    Process: 2401832 ExecStart=/usr/bin/dockerd -H fd:// --containerd=/run/containerd/containerd.sock (code=exited, status=1/FAILURE)
   Main PID: 2401832 (code=exited, status=1/FAILURE)
dpkg: error processing package docker-ce (--configure):
#+end_example

So we use the retry() function defined in scriptlib.zsh to try it twice, it
seems to succeed the second time


#+begin_src shell
retry 2 bash -c "curl https://get.docker.com | sh"
#+end_src

* nvidia-docker

#+begin_src shell

# https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/install-guide.html#pre-requisites
distribution=$(
    . /etc/os-release
    # 20.04 is latest at this time
    # echo ${ID}${VERSION_ID}
    echo ${ID}20.04
) &&
    curl -s -L https://nvidia.github.io/nvidia-docker/gpgkey | sudo apt-key add - &&
    curl -s -L https://nvidia.github.io/nvidia-docker/$distribution/nvidia-docker.list | sudo tee /etc/apt/sources.list.d/nvidia-docker.list

sudo apt-get update && sudo apt-get install --no-install-recommends -y nvidia-container-toolkit
#+end_src

** COMMENT rootless mode gpus

Change settings to allow GPUs to be used by container in rootless mode
https://github.com/NVIDIA/nvidia-docker/issues/1155

#+begin_src shell

toml_file='/etc/nvidia-container-runtime/config.toml'
selector='.nvidia-container-cli.no-cgroups'
current_no_cgroups=$(dasel -f $toml_file $selector || echo 'false')
[[ ${current_no_cgroups:-'false'} == 'true' ]] || {
    echo 'Editing $toml_file:'
    sudo cp $toml_file ${toml_file}.bak &&
        sudo_with_env dasel put bool -f $toml_file $selector 'true'
}
#+end_src

* COMMENT Rootless setup & postinstall

#+begin_src shell

# ------------------------------------------------- #
# https://docs.docker.com/engine/security/rootless/ #
# ------------------------------------------------- #

sudo apt-get install --no-install-recommends -y uidmap
dockerd-rootless-setuptool.sh install --force
#+end_src

** Replace system service

#+begin_src shell
sudo systemctl disable --now docker.service docker.socket
systemctl --user restart docker.service
loginctl enable-linger
#+end_src

** Restart docker

#+begin_src shell
systemctl --user restart docker.service
#+end_src

** Testing

(see [[file:~/.zshcustom/docker.zsh::Only for rootless install][export DOCKER_HOST]])

#+begin_src shell
DOCKER_HOST=unix:///run/user/$UID/docker.sock docker run hello-world
DOCKER_HOST=unix:///run/user/$UID/docker.sock docker run --rm --gpus all nvidia/cuda:11.6.0-base-ubuntu20.04 nvidia-smi
#+end_src

* Rootful postinstall

** Restart docker

#+begin_src shell
sudo systemctl restart docker.service
#+end_src

** Testing

#+begin_src shell
docker run hello-world
sudo docker run --rm --gpus all --ipc=host nvidia/cuda:11.6.0-base-ubuntu20.04 nvidia-smi
#+end_src

* docker-compose

#+begin_src shell
pipx install docker-compose
#+end_src

* COMMENT Uninstall

#+begin_src shell
sudo apt-get purge docker-ce docker-ce-cli containerd.io docker docker-engine docker.io containerd runc uidmap nvidia-container-toolkit
systemctl --user disable docker.service
sudo systemctl disable docker.service
pipx uninstall docker-compose
#+end_src
